[
  {
    "thoughtTitle":"MetMo Pocket Driver",
    "thoughtText": "A classic Icon of engineering history, miniaturised for the first time to create a tool unlike anything else. Bringing back a tool from the past to fix problems of today, they truly don't make them like this anymore.",
    "thoughtAuthor": "Nikhil"
  },
  {
    "thoughtTitle":"Fractured Sky",
    "thoughtText": "Fractured Sky puts you at the helm of an airship expedition to recover fragments of a magical falling star. Its gameplay is a unique combination of area control, resource management, blind bidding and a hint of deduction.",
    "thoughtAuthor": "Brandon"
  },
  {
    "thoughtTitle":"Alchemy RPG: A Reimagined Virtual Tabletop",
    "thoughtText": "Alchemy is the world's first virtual tabletop (VTT) built specifically for cinematic immersion and theater of the mind gameplay. Its scene-based structure empowers gamemasters to tell incredible stories with animated enviroments, particle effects, ambient sound and music.",
    "thoughtAuthor": "Kevin"
  },
  {
    "thoughtTitle":"Duovox Ultra: Military-Grade Night Vision Monocular",
    "thoughtText": "A military-grade night vision monocular partner for the true explorers of the great outdoors. An advanced 1080 FHD resolution camera that captures every detail in real-time full color even in pitch darkness. All packed in Duovox Ultra.",
    "thoughtAuthor": "Davey"
  },
  {
    "thoughtTitle":"The Wolf Fang -- Titanium EDC Keychain Multitool",
    "thoughtText": "A Compact and Durable Keychain Tool with Multiple Functions, Including an Everlasting Pen, Pry Bar, Spike, Bottle Opener, and More.",
    "thoughtAuthor": "Carlos"
  },
  {
    "thoughtTitle":"The Bloom Book",
    "thoughtText": "Hello! My name is Libby and the Bloom Book is a collection of my illustrated florals. Because of the mass amount of florals I illustrated, I wanted to compile them into a lovely little book so that anyone could have a piece of my floral work for themself. ",
    "thoughtAuthor": "Nikhil"
  },
  {
    "thoughtTitle":"Pebble Time - Awesome Smartwatch, No Compromises",
    "thoughtText": "The new color e-paper display is easy to read and always-on, perfect for displaying incoming notifications and your favorite watchface. Compared with LCD or OLED, power consumption is minimized, enabling Pebble Time to achieve an industry-leading battery life.",
    "thoughtAuthor": "Brandon"
  },
  {
    "thoughtTitle":"Exploding Kittens",
    "thoughtText": "A highly strategic kitty-powered version of Russian Roulette. Players take turns drawing cards until someone draws an exploding kitten and loses the game. The deck is made up of cards that let you avoid exploding by peeking at cards before you draw, forcing your opponent to draw.",
    "thoughtAuthor": "Kevin"
  },
  {
    "thoughtTitle":"Fidget Cube: A Vinyl Desk Toy",
    "thoughtText": "An unusually addicting, high-quality desk toy designed to help you focus. Fidget at work, in class, and at home in style.",
    "thoughtAuthor": "Davey"
  },
  {
    "thoughtTitle":"Pono Music - Where Your Soul Rediscovers Music",
    "thoughtText": "Pono is Hawaiian for righteous. What righteous means to our founder Neil Young is honoring the artist’s intention, and the soul of music. That’s why he’s been on a quest, for a few years now, to revive the magic that has been squeezed out of digital music",
    "thoughtAuthor": "Carlos"
  }
]
